01  SAMPLERECORD.
05  RECTYPE           PIC X(1).
05  ACCOUNTNUMBER     PIC 9(5).
05  CUSTOMERNAME      PIC X(20).
05  BALANCEAMOUNT     PIC S9(7)V99 COMP-3.
05  TRANSACTIONCOUNT  PIC 9(3) COMP-3.
05  STATUSCODE        PIC 9(1).

